<section class="portfolio">
    <div class="container">

        <h2 class="subheading">Мои работы</h2>

        <div class="portfolio-item">
            <h3>Гипервизор <span class="term">Sand</span></h3>
            <p>Гипервизор 2-ого типа, основывающийся на&nbsp;технологии аппаратной
                виртуализации <span class="term">Intel VT-x.</span> Позволяет запускать гостевой код в
                изолированном окружении. Использует механизм <span class="term">EPT</span> для отображения
                гостевой памяти. Гипервизор реализован в&nbsp;виде модуля ядра <span class="term">Linux</span>.</p>
        </div>

        <div class="portfolio-item">
            <h3>Криптографический модуль <span class="term">CryptoPipe</span></h3>
            <p>Модуль ядра <span class="term">Linux</span>, предоставляющий несколько каналов шифрования/дешифрования
                данных. Основан на&nbsp;алгоритме <span class="term">Blowfish</span>, реализующим блочное симметричное
                шифрование
                с&nbsp;переменной длиной ключа. Доступ к&nbsp;каналу осуществляется через специализированный
                файл устройства <span class="term">/dev/cpipe</span>.</p>
        </div>

        <div class="portfolio-item">
            <h3>Система автоматизированного синтеза программных прошивок</h3>
            <p>Представляет из&nbsp;себя программный комплекс для создания прошивок приборов с&nbsp;кафедры <span
                    class="term">К3&nbsp;МФ МГТУ</span>. Ключевой
                особенностью решения является его модульность: конкретные прошивки для приборов собираются
                из&nbsp;готового
                набора программных модулей,
                которые требуют лишь минимальной доработки для совместного использования.</p>
        </div>

        <div class="portfolio-item">
            <h3>Приложение <span class="term">CustomBookmarks</span></h3>
            <p>Графическое приложение для хранения закладок браузера. Реализованы поиск по&nbsp;категориям, несколько
                способов сортировки (по&nbsp;названию, по&nbsp;дате добавления, по&nbsp;частоте обращения). Приложение
                разработано
                с&nbsp;использованием библиотеки&nbsp;<span class="term">Qt</span>, за&nbsp;хранение закладок отвечает
                СУБД
                <span class="term">MySQL</span>.</p>
        </div>

        <div class="portfolio-item">
            <h3>Комплект лабораторных работ по&nbsp;сиcтемному программированию для <span class="term">x86</span></h3>
            <p>Включает в&nbsp;себя несколько лабораторных лабот, посвященных рассмотрению
                основных аспектов процессоров <span class="term">Intel x86</span>: переход в&nbsp;защищенный режим,
                обработка исключений и&nbsp;аппаратных прерываний, страничное преобразование
                адресов, многозадачность. Лабораторные работы предназначены для курса
                &laquo;организация ЭВМ&raquo;.</p>
        </div>

        <div class="portfolio-item">
            <h3>Комплект лабораторных работ по&nbsp;периферийным устройствам</h3>
            <p>Включает в&nbsp;себя лабораторные работы, посвященные изучению различных
                периферийных устройств (терминал, клавиатура, мышь) и&nbsp;их&nbsp;интерфейсов
                (<span class="term">JTAG UART, RS232, irDA, PS/2</span>). Лабораторные работы предназначены для
                курса &laquo;Периферийные устройства ЭВМ&raquo;.</p>
        </div>

        <div class="portfolio-item">
            <h3>Магазин товаров для дома</h3>
            <p>Мой первый сайт на&nbsp;<span class="term">HTML&nbsp;Academy</span>. Этот пункт предложено добавить
                в&nbsp;условии
                задания.</p>
            <a class="button" href="source/project/index.html">Открыть страницу</a>
        </div>

    </div>
</section>
